from datetime import time

# Единый источник истины для времени пар и их номеров.
# Ключ: строка времени из API. Значение: список, содержащий:
# [0] время начала,
# [1] время конца (официальное),
# [2] время начала (второй пары для сдвоенных),
# [3] время конца (второй пары для сдвоенных),
# [4] номер(а) пары.
RINGS: dict[str, list[tuple[tuple[time, time], tuple[time, time]]]] = {
    "с": [
        ((time(9, 0), time(10, 30)), (time(10, 45), time(12, 15))),
        ((time(13, 10), time(14, 40)), (time(14, 55), time(16, 25))),
    ],
    "л": [
        ((time(9, 0), time(9, 45)), (time(9, 50), time(10, 35))),
        ((time(10, 55), time(11, 40)), (time(11, 45), time(12, 30))),
        ((time(13, 10), time(13, 55)), (time(14, 0), time(14, 45))),
        ((time(15, 0), time(15, 45)), (time(15, 50), time(16, 35))),
        ((time(16, 45), time(17, 30)), (time(17, 35), time(18, 20))),
    ],
}


# Словари для работы с днями недели
WEEK_DAYS = {"пн": 0, "вт": 1, "ср": 2, "чт": 3, "пт": 4, "сб": 5, "вс": 6}
WEEK_DAYS_INVERTED = {0: "Пн", 1: "Вт", 2: "Ср", 3: "Чт", 4: "Пт", 5: "Сб", 6: "Вс"}

# Константы для ширины колонок в Excel
WIDTH_COLUMNS = [8, 13, 4, 4, 16, 4, 20]
